# Итераторы и Генераторы в Python

Проект содержит решения домашних заданий по теме "Iterators. Generators. Yield" с реализацией различных подходов к обходу вложенных списков.

## Описание

Данный репозиторий содержит четыре реализации для "выравнивания" (flattening) вложенных списков:

1. **FlatIterator** - итератор для двухуровневых списков
2. **flat_generator** - генератор для двухуровневых списков  
3. **FlatIteratorAdvanced** - итератор для любого уровня вложенности
4. **flat_generator_advanced** - генератор для любого уровня вложенности

## Структура проекта

```
├── main.py                 # Основной файл с решениями
├── README.md              # Документация проекта
```

## Задания

### Задание 1: Простой итератор

Класс `FlatIterator` для обработки списков списков (двухуровневая структура).

**Входные данные:**
```python
[
    ['a', 'b', 'c'],
    ['d', 'e', 'f', 'h', False],
    [1, 2, None]
]
```

**Результат:**
```python
['a', 'b', 'c', 'd', 'e', 'f', 'h', False, 1, 2, None]
```

### Задание 2: Простой генератор

Функция `flat_generator` - генераторная версия для двухуровневых структур.

**Особенности:**
- Возвращает `types.GeneratorType`
- Ленивое вычисление элементов
- Меньшее потребление памяти

### Задание 3: Продвинутый итератор

Класс `FlatIteratorAdvanced` для обработки списков с **любым уровнем вложенности**.

**Входные данные:**
```python
[
    [['a'], ['b', 'c']],
    ['d', 'e', [['f'], 'h'], False],
    [1, 2, None, [[[[['!']]]]], []]
]
```

**Результат:**
```python
['a', 'b', 'c', 'd', 'e', 'f', 'h', False, 1, 2, None, '!']
```

### Задание 4: Продвинутый генератор

Функция `flat_generator_advanced` - рекурсивный генератор для многоуровневой вложенности.

**Особенности:**
- Использует `yield from` для делегирования
- Рекурсивный подход
- Элегантное решение для глубокой вложенности

## Технические детали

### Алгоритмы

**Простые версии (1-2):**
- Используют два индекса/цикла для двухуровневого обхода
- Временная сложность: O(n), где n - общее количество элементов
- Пространственная сложность: O(1) для итератора, O(1) для генератора

**Продвинутые версии (3-4):**
- Итератор использует стек для отслеживания состояния
- Генератор использует рекурсию с `yield from`
- Временная сложность: O(n), где n - общее количество элементов
- Пространственная сложность: O(d) для итератора, O(d) для генератора, где d - максимальная глубина вложенности

### Протокол итератора

Все итераторы реализуют стандартный протокол Python:
- `__iter__()` - возвращает объект итератора
- `__next__()` - возвращает следующий элемент или поднимает `StopIteration`

## Установка и запуск

### Требования
- Python 3.6+
- Дополнительные библиотеки не требуются (используется только стандартная библиотека)

### Запуск

```bash
# Клонирование репозитория
git clone <your-repository-url>
cd iterators-generators-homework

# Запуск всех тестов
python main.py
```

### Ожидаемый вывод

```
Запуск всех тестов...
Тест 1 пройден успешно!
Тест 2 пройден успешно!
Тест 3 пройден успешно!
Тест 4 пройден успешно!
Все тесты пройдены успешно!
```

## Примеры использования

### Использование итератора

```python
from main import FlatIterator

nested_list = [['a', 'b'], ['c', 'd']]
flat_iter = FlatIterator(nested_list)

# Способ 1: цикл for
for item in flat_iter:
    print(item)

# Способ 2: преобразование в список
result = list(FlatIterator(nested_list))
print(result)  # ['a', 'b', 'c', 'd']
```

### Использование генератора

```python
from main import flat_generator

nested_list = [['a', 'b'], ['c', 'd']]

# Способ 1: цикл for
for item in flat_generator(nested_list):
    print(item)

# Способ 2: преобразование в список
result = list(flat_generator(nested_list))
print(result)  # ['a', 'b', 'c', 'd']
```

### Работа с многоуровневой вложенностью

```python
from main import FlatIteratorAdvanced, flat_generator_advanced

deep_nested = [[[1, 2]], [3, [4, [5]]]]

# Итератор
result1 = list(FlatIteratorAdvanced(deep_nested))
print(result1)  # [1, 2, 3, 4, 5]

# Генератор
result2 = list(flat_generator_advanced(deep_nested))
print(result2)  # [1, 2, 3, 4, 5]
```

## Тестирование

Все реализации покрыты юнит-тестами, которые проверяют:
- Корректность результата
- Совместимость с протоколом итератора
- Тип возвращаемого объекта для генераторов
- Обработку краевых случаев (пустые списки, различные типы данных)

## Производительность

### Сравнение подходов

| Подход | Память | Скорость | Простота |
|--------|---------|----------|----------|
| Простой итератор | ⭐⭐⭐⭐⭐ | ⭐⭐⭐⭐ | ⭐⭐⭐⭐⭐ |
| Простой генератор | ⭐⭐⭐⭐⭐ | ⭐⭐⭐⭐⭐ | ⭐⭐⭐⭐⭐ |
| Продвинутый итератор | ⭐⭐⭐ | ⭐⭐⭐ | ⭐⭐⭐ |
| Продвинутый генератор | ⭐⭐⭐⭐ | ⭐⭐⭐⭐ | ⭐⭐⭐⭐ |

**Рекомендации:**
- Для простых двухуровневых структур используйте `flat_generator`
- Для сложных многоуровневых структур используйте `flat_generator_advanced`
- Используйте итераторы, если нужен больший контроль над процессом итерации

## Дополнительные возможности

### Обработка различных типов данных

Все реализации корректно обрабатывают:
- Строки
- Числа (int, float)
- Логические значения (True, False)
- None
- Пустые списки

### Обработка ошибок

- Корректное поднятие `StopIteration` при достижении конца
- Проверка типов для определения вложенных списков
- Обработка пустых входных данных
##  
